app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'ss'
 LIMIT 1
---
    public function login()
    {
        if (session()->has('user_id')) {
            return redirect()->to('/');
        }

        if ($this->request->getMethod() === 'POST') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $model = new UserModel();
            $user = $model->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `username` = 'ss'
 LIMIT 1
INSERT INTO `users` (`username`, `password`) VALUES ('ss', '$2y$12$xEnS.DlypN48VfMuVJuRrOJxXc3M9dt7Y3WRILptsIqnplr/INMEK')
---
    public function register()
    {
        if (session()->has('user_id')) {
            return redirect()->to('/');
        }

        if ($this->request->getMethod() === 'POST') {
            $model = new UserModel();

            $existing = $model->where('username', $this->request->getPost('username'))->first();
            if ($existing) {
                return view('auth/register', ['error' => 'Ce nom d\'utilisateur existe déjà']);
            }

            $model->insert([
                'username' => $this->request->getPost('username'),
                'password' => $this->request->getPost('password')
            ]);