app/Controllers/Tasks.php

    public function add()
    {
        $redirect = $this->checkAuth();
        if ($redirect) return $redirect;

        if ($this->request->getMethod() === 'POST') {
            $model = new TaskModel();
            $model->insert([
                'title' => $this->request->getPost('title'),
                'description' => $this->request->getPost('description'),
                'status' => 'en cours',
                'user_id' => session()->get('user_id')
            ]);
---
INSERT INTO `tasks` (`title`, `description`, `status`, `user_id`) VALUES ('d', 'd', 'en cours', '2')

    public function delete($id)
    {
        $redirect = $this->checkAuth();
        if ($redirect) return $redirect;

        $model = new TaskModel();
        $task = $model->getTaskByIdAndUser($id, session()->get('user_id'));

        if ($task) {
            $model->delete($id);
---
DELETE FROM `tasks`
WHERE `id` IN ('3')