app/Models/TaskModel.php

    public function getTasksByUser($userId)
    {
        return $this->where('user_id', $userId)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '3'
ORDER BY `id` DESC

    public function getTaskByIdAndUser($id, $userId)
    {
        return $this->where('id', $id)->where('user_id', $userId)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '3'
AND `user_id` = '2'
 LIMIT 1